exampleRequests/getArrivalDepartureBoard.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:typ="http://thalesgroup.com/RTTI/2013-11-28/Token/types" xmlns:ldb="http://thalesgroup.com/RTTI/2017-10-01/ldb/"><soap:Header><typ:AccessToken><typ:TokenValue>$$TOKEN$$</typ:TokenValue></typ:AccessToken></soap:Header><soap:Body><ldb:GetArrivalDepartureBoardRequest><ldb:numRows>15</ldb:numRows><ldb:crs>ISL</ldb:crs><ldb:filterCrs></ldb:filterCrs><ldb:filterType>to</ldb:filterType><ldb:timeOffset>0</ldb:timeOffset><ldb:timeWindow>120</ldb:timeWindow></ldb:GetArrivalDepartureBoardRequest></soap:Body></soap:Envelope>
